/**
 * 按位或
 *      0001
 *      0010
 *      0100
 *      1000
 * res: 1111  15
 */
console.log(1 | 2 | 4 | 8)

/**
 * 按位与
 *      0001
 *      0010
 *      0100
 *      1000
 * res: 0000  0
 */
 console.log(1 & 2 & 4 & 8)


/**
 * 按位异或
 *      0001
 *      0010
 *      0100
 *      1000
 * res: 1111  15
 */
 console.log(1 ^ 2 ^ 4 ^ 8)


 /**
 * 左移运算符
 * 10 << 2
 * 1010 左移两位，右边使用00补充
 * 1010 00
 */
console.log(10 << 2)


 /**
 * 右移运算符
 * 10 >> 2
 * 0110 右移两位，左边使用00补充
 * 0010
 */
  console.log(10 >> 2)

  
  /**
 * 无符号右移运算符
 * 10 >>> 2
 * 0110 右移两位，左边使用00补充
 * 0010
 */
  console.log(10 >>> 2)